import os

from dotenv import load_dotenv


def data_for_test_get_get_currencies_rate() -> dict:
    """ Возвращает данные из файла user_settings.json"""
    load_dotenv()
    apikey = os.getenv("API_KEY")
    headers = {"apikey": f"{apikey}"}
    params = {"to": "RUB", "from": ["USD", "EUR"], "amount": 1}
    currencies_and_stocks = {
  "user_currencies": ["USD", "EUR"],
  "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]
        }
    return currencies_and_stocks, headers, params


def get_operations_list()-> list:
    """  """
    operations =  [{'MCC': 5499.0,
   'Бонусы (включая кэшбэк)': 1,
   'Валюта операции': 'RUB',
   'Валюта платежа': 'RUB',
   'Дата операции': '03.01.2018 15:03:35',
   'Дата платежа': '04.01.2018',
   'Категория': 'Супермаркеты',
   'Кэшбэк': None,
   'Номер карты': '*7197',
   'Округление на инвесткопилку': 0,
   'Описание': 'Magazin 25',
   'Статус': 'OK',
   'Сумма операции': -73.06,
   'Сумма операции с округлением': 73.06,
   'Сумма платежа': -73.06},
  {'MCC': 5977.0,
   'Бонусы (включая кэшбэк)': 0,
   'Валюта операции': 'RUB',
   'Валюта платежа': 'RUB',
   'Дата операции': '03.01.2018 14:55:21',
   'Дата платежа': '05.01.2018',
   'Категория': 'Красота',
   'Кэшбэк': None,
   'Номер карты': '*7197',
   'Округление на инвесткопилку': 0,
   'Описание': 'OOO Balid',
   'Статус': 'OK',
   'Сумма операции': -21.0,
   'Сумма операции с округлением': 21.0,
   'Сумма платежа': -21.0},
  {'MCC': 5977.0,
   'Бонусы (включая кэшбэк)': 6,
   'Валюта операции': 'RUB',
   'Валюта платежа': 'RUB',
   'Дата операции': '01.01.2018 20:27:51',
   'Дата платежа': '04.01.2018',
   'Категория': 'Красота',
   'Кэшбэк': None,
   'Номер карты': '*7197',
   'Округление на инвесткопилку': 0,
   'Описание': 'OOO Balid',
   'Статус': 'OK',
   'Сумма операции': -316.0,
   'Сумма операции с округлением': 316.0,
   'Сумма платежа': -316.0},
  {'MCC': None,
   'Бонусы (включая кэшбэк)': 0,
   'Валюта операции': 'RUB',
   'Валюта платежа': 'RUB',
   'Дата операции': '01.01.2018 12:49:53',
   'Дата платежа': '01.01.2018',
   'Категория': 'Переводы',
   'Кэшбэк': None,
   'Номер карты': None,
   'Округление на инвесткопилку': 0,
   'Описание': 'Линзомат ТЦ Юность',
   'Статус': 'OK',
   'Сумма операции': -3000.0,
   'Сумма операции с округлением': 3000.0,
   'Сумма платежа': -3000.0}]

    return operations